#Напишите функцию, которая будет преобразовывать цену к формату, отображающему до двух знаков после точки
def pricetwo():
    price_str=input('Введите число: ')
    if price_str.isdigit():
     price_str=float(price_str)
     txt = 'Число = {:.2f}'
     print(txt.format(price_str))
    else:
          print("Вы ввели не числовое значение.")
pricetwo()
