# Дан список из строк. Используя join, соедините строки так, чтобы они были разделены через запятую.
# На выходе должна получиться строка в виде "my_string1,my_string2,my_string3"
list_str = ['my_string1','my_string2','my_string3','my_string4','my_string5','my_string6','my_string7','my_string8','my_string9','my_string10','my_string11']
string_str = ','.join(list_str)
print('String from list - ', string_str)
